/*
 JavaScript has 8 Datatypes
1. String ->দুইটা "" কোটেশনের মধ্যে ট্যাক্স লেখাকেই স্টিং বলে 
2. Number -> কোন একটা সংখ্যা লেখাকে জাভাস্ক্রিপ্ট নাম্বার বলে /
3. Bigint -> JavaScript BigInt হল একটি নতুন ডেটাটাইপ (2020) যা পূর্ণসংখ্যা সংরক্ষণ করতে ব্যবহার করা যেতে পারে
4. Boolean - বলিয়ান আমাদের সত্য বা মিথ্যা রিটার্ন করে
5. Undefined -কোনো একটা ভ্যারিয়েবল লেখছি কিন্তু কোনো ভ্যালু এসাইন করিনি কিন্তু অ্যাক্সেস করতে চাচ্ছি তখন আনডিফাইন্ড হয় 
জাভাস্ক্রিপ্টে আনডিফাইন্ড হলো একটি ভেরিযবল যার কোনো ভেলু নেই।.
একটি ভেরিযবলকে আনডিফাইন্ড ডিক্লেয়ার করার মাধ্যমেও ভেরিযবলের ভেলু খালি করা যায়। 
6. Null- 
7. Symbol
8. Object
The Object Datatype
The object data type can contain:

1. An object
2. An array
3. A date 
*/